# AIRLINES LOYALTY SYSTEM

In [32]:
import pandas as pd
df_customers= pd.read_csv(r"C:\Users\javie\OneDrive\Escritorio\Customers.csv")
df_customers.head()

,Loyalty_number,Country,Province,City,Postal_code,Gender,Education,Salary,Marital Status,Loyalty_card,CLV,Enrollment_type,Enrollment_year,Enrollment_month,Cancellation_year,Cancellation_month
0,480934.0,Canada,Ontario,Toronto,M2Z 4K1,Female,Bachelor,83236.0,Married,Star,383914.0,Standard,2016.0,2.0,0.0,0.0
1,549612.0,Canada,Alberta,Edmonton,T3G 6Y6,Male,College,0.0,Divorced,Star,383961.0,Standard,2016.0,3.0,0.0,0.0
2,429460.0,Canada,British Columbia,Vancouver,V6E 3D9,Male,College,0.0,Single,Star,383975.0,Standard,2014.0,7.0,2018.0,1.0
3,608370.0,Canada,Ontario,Toronto,P1W 1K4,Male,College,0.0,Single,Star,383975.0,Standard,2013.0,2.0,0.0,0.0
4,530508.0,Canada,Quebec,Hull,J8Y 3Z5,Male,Bachelor,103495.0,Married,Star,384279.0,Standard,2014.0,10.0,0.0,0.0

In [33]:
df_movements = pd.read_csv(r"C:\Users\javie\OneDrive\Escritorio\movements.csv")
df_movements.head()

,Loyalty_number,Year,Month,Total_flights,Distance,Points_accumulated,Points_redeemed,Dollar_cost_points_redeemed
0,100590,2018,6,12,15276,22914,0,0
1,100590,2018,7,12,9168,13752,0,0
2,100590,2018,5,4,6504,9756,0,0
3,100590,2018,10,0,0,0,512,92
4,100590,2018,2,0,0,0,0,0

In [34]:
df_merge= pd.merge(df_customers,df_movements, on="Loyalty_number", how="inner") 
df_merge.head

<bound method NDFrame.head of         Loyalty_number Country  Province      City Postal_code  Gender  \
0             480934.0  Canada   Ontario   Toronto     M2Z 4K1  Female
1             480934.0  Canada   Ontario   Toronto     M2Z 4K1  Female
2             480934.0  Canada   Ontario   Toronto     M2Z 4K1  Female
3             480934.0  Canada   Ontario   Toronto     M2Z 4K1  Female
4             480934.0  Canada   Ontario   Toronto     M2Z 4K1  Female
...                ...     ...       ...       ...         ...     ...
392931        652627.0  Canada  Manitoba  Winnipeg     R2C 0M5  Female
392932        652627.0  Canada  Manitoba  Winnipeg     R2C 0M5  Female
392933        652627.0  Canada  Manitoba  Winnipeg     R2C 0M5  Female
392934        652627.0  Canada  Manitoba  Winnipeg     R2C 0M5  Female
392935        652627.0  Canada  Manitoba  Winnipeg     R2C 0M5  Female

       Education   Salary Marital Status Loyalty_card  ...  Enrollment_month  \
0       Bachelor  83236.0        Married         Star  ...               2.0
1       Bachelor  83236.0        Married         Star  ...               2.0
2       Bachelor  83236.0        Married         Star  ...               2.0
3       Bachelor  83236.0        Married         Star  ...               2.0
4       Bachelor  83236.0        Married         Star  ...               2.0
...          ...      ...            ...          ...  ...               ...
392931  Bachelor  75049.0        Married         Star  ...              12.0
392932  Bachelor  75049.0        Married         Star  ...              12.0
392933  Bachelor  75049.0        Married         Star  ...              12.0
392934  Bachelor  75049.0        Married         Star  ...              12.0
392935  Bachelor  75049.0        Married         Star  ...              12.0

       Cancellation_year  Cancellation_month  Year  Month  Total_flights  \
0                    0.0                 0.0  2018      7              5
1                    0.0                 0.0  2017      5              4
2                    0.0                 0.0  2017      6              4
3                    0.0                 0.0  2017      8              4
4                    0.0                 0.0  2018      4              4
...                  ...                 ...   ...    ...            ...
392931            2016.0                 8.0  2018      8              0
392932            2016.0                 8.0  2018      9              0
392933            2016.0                 8.0  2018     10              0
392934            2016.0                 8.0  2018     11              0
392935            2016.0                 8.0  2018     12              0

        Distance  Points_accumulated  Points_redeemed  \
0          11355               11355                0
1           4908                4908                0
2           6948                6948                0
3           5516                5516                0
4           4376                4376                0
...          ...                 ...              ...
392931         0                   0                0
392932         0                   0                0
392933         0                   0                0
392934         0                   0                0
392935         0                   0                0

        Dollar_cost_points_redeemed
0                                 0
1                                 0
2                                 0
3                                 0
4                                 0
...                             ...
392931                            0
392932                            0
392933                            0
392934                            0
392935                            0

[392936 rows x 23 columns]>

    * Let's see the DF info

In [35]:
df_merge.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 392936 entries, 0 to 392935
Data columns (total 23 columns):
 #   Column                       Non-Null Count   Dtype
---  ------                       --------------   -----
 0   Loyalty_number               392936 non-null  float64
 1   Country                      392936 non-null  object
 2   Province                     392936 non-null  object
 3   City                         392936 non-null  object
 4   Postal_code                  392936 non-null  object
 5   Gender                       392936 non-null  object
 6   Education                    392936 non-null  object
 7   Salary                       392936 non-null  float64
 8   Marital Status               392936 non-null  object
 9   Loyalty_card                 392936 non-null  object
 10  CLV                          392936 non-null  float64
 11  Enrollment_type              392936 non-null  object
 12  Enrollment_year              392936 non-null  float64
 13  Enrollment_month             392936 non-null  float64
 14  Cancellation_year            392936 non-null  float64
 15  Cancellation_month           392936 non-null  float64
 16  Year                         392936 non-null  int64
 17  Month                        392936 non-null  int64
 18  Total_flights                392936 non-null  int64
 19  Distance                     392936 non-null  int64
 20  Points_accumulated           392936 non-null  int64
 21  Points_redeemed              392936 non-null  int64
 22  Dollar_cost_points_redeemed  392936 non-null  int64
dtypes: float64(7), int64(7), object(9)
memory usage: 69.0+ MB

    * View card types available in the DF

In [36]:
df_merge["Loyalty_card"].unique()

array(['Star', 'Aurora', 'Nova'], dtype=object)

    * View the column Enrollment_type

In [37]:
df_merge["Enrollment_type"].unique()

array(['Standard', '2018 Promotion'], dtype=object)

    * View customers education level

In [38]:
df_merge["Education"].unique()

array(['Bachelor', 'College', 'Master', 'High School or Below', 'Doctor'],
      dtype=object)

    * View the marital status

In [39]:
df_merge["Marital Status"].unique()

array(['Married', 'Divorced', 'Single'], dtype=object)

    * View the customer's gender available in the DF

In [40]:
df_merge["Gender"].unique()

array(['Female', 'Male'], dtype=object)

    * Show the TOP 10 customers with the most points accumulated

In [71]:
df_sorted_by_points_accum = df_merge.sort_values(by="Points_accumulated", ascending=False)
df_sorted_by_points_accum_subset = df_sorted_by_points_accum[["Loyalty_number", "Points_accumulated","Gender","Marital Status","Education"]]
df_sorted_by_points_accum_subset.head(30)

,Loyalty_number,Points_accumulated,Gender,Marital Status,Education
264480,387214.0,548775,Female,Married,Bachelor
40616,857878.0,548775,Female,Divorced,Bachelor
222982,130497.0,545175,Female,Married,Bachelor
212678,834726.0,513225,Female,Single,Doctor
307088,222280.0,499275,Female,Divorced,College
390353,371737.0,491625,Female,Divorced,Bachelor
193847,594598.0,488925,Female,Divorced,Bachelor
347008,928438.0,479475,Male,Single,College
219874,175902.0,462375,Male,Married,Bachelor
12211,343051.0,460125,Male,Married,Bachelor
31818,856229.0,446625,Male,Single,Bachelor
12315,794248.0,446175,Male,Single,College
366279,368391.0,442575,Male,Single,Bachelor
55520,562661.0,441225,Female,Married,Bachelor
344090,102788.0,421875,Male,Single,Bachelor
221045,492973.0,412875,Male,Married,Bachelor
10353,133324.0,408375,Male,Married,Bachelor
53483,366049.0,388575,Male,Married,High School or Below
8081,712114.0,380925,Female,Married,Bachelor
73263,311692.0,378675,Female,Married,College
208306,153582.0,376875,Female,Single,College
4752,110262.0,359775,Male,Married,Bachelor
389792,898427.0,357525,Male,Single,College
113021,744320.0,334125,Female,Married,Doctor
276414,496831.0,331965,Female,Married,Bachelor
349138,943804.0,328725,Female,Single,College
136263,686397.0,327375,Male,Married,College
185083,922614.0,324135,Male,Divorced,Bachelor
381945,504867.0,320625,Female,Married,Bachelor
214125,656027.0,317115,Male,Married,Doctor